Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.IsCurveLoopValid(Autodesk.Revit.DB.CurveLoop)
Checks if curve loop is valid for Analytical Panel.
profile:
The curve loop to be checked.
Returns:
Returns true if curve loop is ok, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.SetOuterContour(Autodesk.Revit.DB.CurveLoop)
Sets the Curve Loop that defines the geometry of the Analytical Surface element.
Remarks:
Curve Loop must be planar and not self-intersecting.
outerContour:
New Curve Loop for the Analytical Surface element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the following requirements is not satisfied :
- curve loop outerContour is not planar
- curve loop outerContour  is self-intersecting
- curve loop outerContour contains zero length curves
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Only planar surfaces can be edited.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.GetOuterContour
Returns the Curve Loop that defines the geometry of the Analytical Surface element.
Returns:
CurveLoop associated with Analytical Surface element.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.SketchId
Sketch associated to this Revit element.
Remarks:
Analytical Element may not have a valid sketch.
To edit the sketch profile you can use Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.SetOuterContour(Autodesk.Revit.DB.CurveLoop) or Autodesk::Revit::DB::SketchEditScope.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
This is the base class for analytical surface elements.
Since:
2023